sdy4011/nrf52_ble_example/nrf52_ble_saadc/examples/arm5_no_packs/my_notify_test/notification_test.c
/**
 * Copyright (c) 2013 - 2021, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
#include "sdk_common.h"
#if NRF_MODULE_ENABLED(BLE_LBS)
#include "notification_test.h"
#include "ble_srv_common.h"
#include "nrf_log.h"
#include "stdio.h"


//	if(err_code != NRF_SUCCESS&&err_code!=BLE_ERROR_INVALID_CONN_HANDLE&&err_code!=NRF_ERROR_INVALID_STATE&&err_code!=BLE_ERROR_GATTS_SYS_ATTR_MISSING)
//	{
//		APP_ERROR_CHECK(err_code);
//	}
//	else
//	{
//		NRF_LOG_INFO("err_code error");
//	}


//	
//static void data_acquisition()
//{
//	nrf_gpio_cfg_input(ARDUINO_A0_PIN,

/**@brief Function for handling the Write event.
 *
 * @param[in] p_lbs      sEMG Service structure.
 * @param[in] p_ble_evt  Event received from the BLE stack.
 */
static void on_write(ble_lbs_t * p_lbs, ble_evt_t const * p_ble_evt)
{
			p_lbs->led_write_handler(p_lbs,p_ble_evt);
//    ble_gatts_evt_write_t const * p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;
//		if ((p_evt_write->handle == p_lbs->led_char_handles.value_handle)&&(p_evt_write->len == 1))
//		{
//				if(p_evt_write->data[0]==0x01)
//			{
//				
//				uint16_t conn_handle = p_ble_evt->evt.common_evt.conn_handle;
//				memset(&ts,0,sizeof(ts));
//				ts.conn_handle = conn_handle;
//				ts.p_lbs = p_lbs;
//				ts.button_state = 0x03;
//				ret_code_t err_code;
//				err_code =  app_timer_create(&notify_timer,APP_TIMER_MODE_REPEATED,timeout);
//				APP_ERROR_CHECK(err_code);
//				app_timer_start(notify_timer,APP_TIMER_TICKS(1000),NULL); //start timer
//			}
//		else if(p_evt_write->data[0]==0x02)
//		{
//			//other command
//			app_timer_stop(notify_timer);
//		}
//		else
//		{
//			app_timer_stop(notify_timer);
//		}
//			p_lbs->led_write_handler(p_ble_evt->evt.gap_evt.conn_handle,p_lbs,p_evt_write->data[0]);
//		}
		
//    if (   (p_evt_write->handle == p_lbs->led_char_handles.value_handle)
//        && (p_evt_write->len == 1)
//        && (p_lbs->led_write_handler != NULL))
//    {
//        p_lbs->led_write_handler(p_ble_evt->evt.gap_evt.conn_handle, p_lbs, p_evt_write->data[0]);
//    }
}

//static void on_connect(ble_lbs_t *p_lbs,ble_evt_t const * p_ble_evt)
//{
//	NRF_LOG_INFO("enter");
//	uint16_t conn_handler = p_ble_evt->evt.gap_evt.conn_handle;
//	memset(&ts,0,sizeof(ts));
//	ts.conn_handle = conn_handler;
//	ts.p_lbs = p_lbs;
//	ts.button_state = 0x03;
//	ret_code_t err_code;
//	err_code =  app_timer_create(&notify_timer,APP_TIMER_MODE_REPEATED,timeout);
//	APP_ERROR_CHECK(err_code);
//	app_timer_start(notify_timer,APP_TIMER_TICKS(1000),NULL); //start timer
////	ble_lbs_on_button_change(conn_handler,p_lbs,'c');
//}

static void on_disconnect(ble_lbs_t *p_lbs,ble_evt_t const *p_ble_evt)
{
	ble_gap_evt_disconnected_t const *p = &p_ble_evt->evt.gap_evt.params.disconnected;
	//do nothing
//	NRF_LOG_INFO(">>>");
	p_lbs->disconnect_handler(p_lbs,p_ble_evt);
}
	
void ble_lbs_on_ble_evt(ble_evt_t const * p_ble_evt, void * p_context)
{
    ble_lbs_t * p_lbs = (ble_lbs_t *)p_context;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GATTS_EVT_WRITE:
            on_write(p_lbs, p_ble_evt);
					
            break;
				case BLE_GAP_EVT_CONNECTED:
//						on_connect(p_lbs,p_ble_evt);
						break;
				case BLE_GAP_EVT_DISCONNECTED:
//							NRF_LOG_INFO("????");
							on_disconnect(p_lbs,p_ble_evt);
							break;
        default:
            // No implementation needed.
            break;
    }
}


uint32_t ble_lbs_init(ble_lbs_t * p_lbs, const ble_lbs_init_t * p_lbs_init)
{
    uint32_t              err_code;
    ble_uuid_t            ble_uuid;
    ble_add_char_params_t add_char_params;

    // Initialize service structure.
    p_lbs->led_write_handler = p_lbs_init->led_write_handler;//
		
		//Initialize notify service write_handler;
		p_lbs->notify_write_handler = p_lbs_init->notify_handler;
	
		p_lbs->disconnect_handler = p_lbs_init->disconnect_handler;

    // Add service.
    ble_uuid128_t base_uuid = {LBS_UUID_BASE};
    err_code = sd_ble_uuid_vs_add(&base_uuid, &p_lbs->uuid_type);
    VERIFY_SUCCESS(err_code);

//    ble_uuid.type = p_lbs->uuid_type;
		ble_uuid.type = BLE_UUID_TYPE_VENDOR_BEGIN; //128 bits
    ble_uuid.uuid = LBS_UUID_SERVICE;

    err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY, &ble_uuid, &p_lbs->service_handle); 
    VERIFY_SUCCESS(err_code);

    // Add Button characteristic.
//    memset(&add_char_params, 0, sizeof(add_char_params));
//    add_char_params.uuid              = LBS_UUID_BUTTON_CHAR;
//    add_char_params.uuid_type         = p_lbs->uuid_type;
//    add_char_params.init_len          = sizeof(uint8_t);
//    add_char_params.max_len           = sizeof(uint8_t);
//    add_char_params.char_props.read   = 1;
//    add_char_params.char_props.notify = 1;
////		add_char_params.char_props.write  = 1;

//    add_char_params.read_access       = SEC_OPEN;
//    add_char_params.cccd_write_access = SEC_OPEN;

//    err_code = characteristic_add(p_lbs->service_handle,
//                                  &add_char_params,
//                                  &p_lbs->button_char_handles);
//    if (err_code != NRF_SUCCESS)
//    {
//        return err_code;
//    }
		//Add notify characteristic.
		
		memset(&add_char_params, 0, sizeof(add_char_params));
		uint8_t init_array[126] = {0x03};
		add_char_params.uuid=LBS_UUID_BUTTON_CHAR;
		add_char_params.uuid_type=p_lbs->uuid_type;
		add_char_params.init_len=126*sizeof(uint8_t);
		add_char_params.max_len = 126*sizeof(uint8_t);
		add_char_params.p_init_value=init_array;
		add_char_params.char_props.read=1;
		add_char_params.char_props.notify =1;
		add_char_params.char_props.write=1;
		add_char_params.is_value_user = 0;
		add_char_params.read_access = SEC_OPEN;
		add_char_params.cccd_write_access = SEC_OPEN;
		err_code = characteristic_add(p_lbs->service_handle,
																	&add_char_params,
																	&p_lbs->notify_char_handles);//need to register by using BLE_LBS_DEF or other
		if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }
		

    // Add command characteristic.
    memset(&add_char_params, 0, sizeof(add_char_params));
    add_char_params.uuid             = LBS_UUID_LED_CHAR;
    add_char_params.uuid_type        = p_lbs->uuid_type;
    add_char_params.init_len         = sizeof(uint8_t);
    add_char_params.max_len          = sizeof(uint8_t);
		uint8_t command_init_array[1] = {0x00};
    add_char_params.char_props.read  = 1;
    add_char_params.char_props.write_wo_resp = 1;
		add_char_params.p_init_value = command_init_array;
    add_char_params.read_access  = SEC_OPEN;
    add_char_params.write_access = SEC_OPEN;

    return characteristic_add(p_lbs->service_handle, &add_char_params, &p_lbs->led_char_handles);
}


uint32_t ble_lbs_on_button_change(uint16_t conn_handle, ble_lbs_t * p_lbs, uint8_t const *a_data)
{
    ble_gatts_hvx_params_t params;
//    uint16_t len = sizeof(button_state);
		uint16_t len = 126*sizeof(uint8_t);
    memset(&params, 0, sizeof(params));
    params.type   = BLE_GATT_HVX_NOTIFICATION;
//    params.handle = p_lbs->button_char_handles.value_handle;
		params.handle = p_lbs->notify_char_handles.value_handle;
//    params.p_data = &button_state;
		params.p_data = a_data;
    params.p_len  = &len;

    return sd_ble_gatts_hvx(conn_handle, &params);
}
#endif // NRF_MODULE_ENABLED(BLE_LBS)
